Revit 2026 API

# IFCAnyHandleGetAttribute Method

---

Gets the attribute by name.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCData GetAttribute(
	string name
)
```
```vb
Public Function GetAttribute (
	name As String
) As IFCData
```
```cpp
public:
IFCData^ GetAttribute(
	String^ name
)
```
```fsharp
member GetAttribute :
        name : string -> IFCData
```

#### Parameters

name String
     The name.

#### Return Value

IFCData The value.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCAnyHandle Class

Autodesk.Revit.DB.IFC Namespace